src/DataProcessors/ВыгрузкаМодуля/ВыгрузкаМодуля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3c338f4-eafa-4408-a527-5cc4ab37dfef">
  <name>ВыгрузкаМодуля</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b00d3374-fba3-4dfd-a8b9-2e9192589501">
  <name>ТипыОбъектов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9a8e9e82-d92a-4009-b106-ec0dad7bbfdc">
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="28f6293b-0a76-4f8d-b741-d6a86e461c95">
    <name>Булево</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c96f080e-8e03-46df-92cf-899101180ccb">
    <name>Строка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="52776854-ef3f-4d53-9b46-b1f5921f3db5">
    <name>Число</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="85dae71e-5343-4aa2-ad48-5bafd0e77bf1">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0ef44e26-9f8a-4f9f-af9f-b045c498816a">
    <name>ХранилищеЗначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="edc93a94-df17-4565-a085-b9635011d6e4">
    <name>УникальныйИдентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3cc366d1-dec6-4c40-bc75-a26c1cc4d307">
    <name>Перечисление</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e59131cc-796f-4a59-b508-b7116216ed5f">
    <name>ЛюбаяСсылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="61c264b5-4a1a-4a85-9134-71d05b5ef74f">
    <name>Справочник</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f39eb3b4-764d-4e49-9149-79a08def2a0e">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b3b69793-028f-4701-963c-d2e5302d5e7b">
    <name>ПланВидовРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3817b5d5-5de7-4f12-85c4-5037b01e683d">
    <name>ПланВидовХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ff655-d737-4f7e-99a8-70bdd157c150">
    <name>ПланОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="556282ca-df4a-4d71-b417-48193ff98076">
    <name>ПланСчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="666398bf-eff8-4172-9c11-f7e1a1382499">
    <name>ТочкаМаршрутаБизнесПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4ec2030-fa42-4716-a9e9-87a282796ebb">
    <name>Задача</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bf7d940d-ea2d-4e76-9a9b-17544835afee">
    <name>ВидРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b65ce0b2-9d46-44a6-8beb-4b6114c07627">
    <name>ВидСубконто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ВыгрузкаМодуля/ObjectModule.bsl
//@skip-check export-procedure-missing-comment

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ВыполнитьВыгрузкуМодулей")
Функция кфкВыполнитьВыгрузкуМодулей() Экспорт

	МенеджерТеги = Справочники.Теги;

	ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конвертация, "Конфигурация, ИспользоватьРазделениеМодуля, ИспользоватьТипизациюПеременных, ГруппироватьПоОбъектамВыгрузки, ЗапретитьПереводИменОбъектовФормата");
	Модули = Новый ТаблицаЗначений;
	Если ДанныеКонвертации.ИспользоватьРазделениеМодуля Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка,
		|	Наименование,
		|	Раздел,
		|	ВЫБОР
		|		КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Базисный)
		|			ТОГДА 4
		|		КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Алгоритмы)
		|			ТОГДА 1
		|		КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Пользовательский)
		|			ТОГДА 3
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Сортировка,
		|	ЛОЖЬ КАК ЕстьПроцедурыВызоваОбработчика,
		|	ЛОЖЬ КАК ЕстьФункцииВызоваОбработчика,
		|	ЛОЖЬ КАК ЭтоМодульМенеджера,
		|	"""" КАК ИмяПапки
		|ИЗ
		|	Справочник.ДополнительныеМодули
		|ГДЕ
		|	Владелец = &Конвертация
		|	И НЕ ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка,
		|	Наименование";
		Запрос.УстановитьПараметр("Конвертация", Конвертация);
		Модули = Запрос.Выполнить().Выгрузить();
		Модули.Колонки.Добавить("ТекстМодуля");
	КонецЕсли;

	// Вычисляем признак добавления тегов.
	Релиз = ДанныеКонвертации.Конфигурация;
	Конфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Релиз, "КонфигурацияВладелец");
	ВыборкаТеги = Справочники.Теги.Выбрать(,Конфигурация);
	ДобавлятьТеги = Ложь;
	СхлопываниеТегов = Новый Массив;
	МаксимальнаяДлинаТега = 0;
	ВсеТеги = Новый Массив;
	Пока ВыборкаТеги.Следующий() Цикл
		ДобавлятьТеги = Истина;
		ТекТег = СокрЛП(ВыборкаТеги.Наименование);
		СтрСхлопывание = "//-- " + ТекТег + Символы.ПС + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание);
		СтрСхлопывание = Символы.Таб + "//-- " + ТекТег + Символы.ПС + Символы.Таб + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание);
		СтрСхлопывание = Символы.Таб + Символы.Таб + "//-- " + ТекТег + Символы.ПС + Символы.Таб + Символы.Таб + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание);
		ДлинаТега = СтрЧислоСтрок(СтрСхлопывание);
		Если ДлинаТега > МаксимальнаяДлинаТега Тогда
			МаксимальнаяДлинаТега = ДлинаТега;
		КонецЕсли;
		ВсеТеги.Добавить(ТекТег);
	КонецЦикла;

	РасширенныеТегиМодуля = МенеджерТеги.ПолучитьРасширенныеТегиПоВладельцу(Конфигурация);

	ПараметрыМодуля = Новый Структура("Релиз, Конфигурация, ДобавлятьТеги, ИспользоватьРазделениеМодуля",
		Релиз, Конфигурация, ДобавлятьТеги, ДанныеКонвертации.ИспользоватьРазделениеМодуля);
	ПараметрыМодуля.Вставить("ИспользоватьТипизациюПеременных", ДанныеКонвертации.ИспользоватьТипизациюПеременных);
	ПараметрыМодуля.Вставить("ГруппироватьПоОбъектамВыгрузки", ДанныеКонвертации.ГруппироватьПоОбъектамВыгрузки);
	МакетТекстовМодулей = ПолучитьМакет("ШаблоныТекстовМодулей");
	МакетТекстовМодулейДетализацияКомментариев = ПолучитьМакет("ШаблоныДетализацииКомментариев");
	ПараметрыМодуля.Вставить("МакетТекстовМодулей", МакетТекстовМодулей);
	ПараметрыМодуля.Вставить("МакетТекстовМодулейДетализацияКомментариев", МакетТекстовМодулейДетализацияКомментариев);
	ПараметрыМодуля.Вставить("ТекстПроцедурыВызоваОбработчика", "");
	ПараметрыМодуля.Вставить("ТекстФункцииВызоваОбработчика", "");
	ПараметрыМодуля.Вставить("ПрограммныйИнтерфейс", Новый ТекстовыйДокумент);

	// Параметры тегов
	ПараметрыМодуля.Вставить("СхлопываниеТегов",		СхлопываниеТегов);
	ПараметрыМодуля.Вставить("МаксимальнаяДлинаТега",	МаксимальнаяДлинаТега);
	ПараметрыМодуля.Вставить("РасширенныеТегиМодуля",	РасширенныеТегиМодуля);
	ПараметрыМодуля.Вставить("МаксимальнаяДлинаРасширенногоТега", 0);
	ПараметрыМодуля.Вставить("ВсеТеги",					ВсеТеги);
	//

	ПараметрыМодуля.Вставить("ЗапретитьПереводИменОбъектовФормата", ДанныеКонвертации.ЗапретитьПереводИменОбъектовФормата);
	ПараметрыМодуля.Вставить("ВерсияФорматаМенеджера", КонвертацияДанныхXDTOСервер.ВерсияФорматаМенеджераОбмена(Конвертация, Истина));

	// Заполнение таблиц правил ПОД, ПКО
	ПараметрыМодуля.Вставить("ПОД_Отправка", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПОД_Получение", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_Отправка", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_Получение", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_ОтправкаИПолучение", Новый ТекстовыйДокумент);

	Если ДанныеКонвертации.ИспользоватьРазделениеМодуля Тогда
		ПараметрыМодуля.Вставить("Модули", Модули);

		Результат = Новый Структура;
		МодульАлгоритмы = Неопределено;
		Для Каждого СтрМодуль Из Модули Цикл
			Если СтрМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Базисный Тогда
				// Перед базисным модулем надо заполнить модули менеджера.
				ЗаполнитьМодулиМенеджеров(Результат, ПараметрыМодуля);
				// Базисный модуль.
				ЗаполнитьБазисныйМодуль(СтрМодуль, ПараметрыМодуля);
			ИначеЕсли СтрМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Алгоритмы Тогда
				// Обработается позднее.
				МодульАлгоритмы = СтрМодуль;
			ИначеЕсли СтрМодуль.ЭтоМодульМенеджера Тогда
				// Дополнительный модуль с выгрузкой в модуль менеджера уже обработан.
				Продолжить;
			Иначе
				ЗаполнитьДополнительныйМодуль_Правила(СтрМодуль, ПараметрыМодуля);
			КонецЕсли;
		КонецЦикла;
		// Модуль Алгоритмы заполняется после всех других модулей, т.к. сначала должны быть заполнены возможные условия применения.
		Если МодульАлгоритмы <> Неопределено Тогда
			ЗаполнитьДополнительныйМодуль_Алгоритмы(МодульАлгоритмы, ПараметрыМодуля);
		КонецЕсли;
		// Замена вызовов алгоритмов после заполнения всех модулей.
		Для Каждого СтрМодуль Из Модули Цикл
			ОбщийТекстМодуля = СтрМодуль.ТекстМодуля;
			Если СтрМодуль.Раздел <> Перечисления.РазделыДополнительныхМодулей.Алгоритмы Тогда
				ПараметрыМодуля.Вставить("ТекущийМодуль", СтрМодуль);
				ЗаменитьВызовыАлгоритмов(ПараметрыМодуля, ОбщийТекстМодуля);
			КонецЕсли;
			Если СтрМодуль.ЭтоМодульМенеджера Тогда
				// Имя модуля в результирующей структуре
				ИмяМодуляДляВозврата = СтрЗаменить(СокрЛП(СтрМодуль.Наименование), ".", "_");
			Иначе
				ИмяМодуляДляВозврата = СокрЛП(СтрМодуль.Наименование);
			КонецЕсли;
			// Удаление идентичных тегов закрытие + открытие
			ОбщийТекстМодуляСтрокой = ОбщийТекстМодуля.ПолучитьТекст();
			ВыполнитьСхлопываниеТеговВМодуле(ПараметрыМодуля, ОбщийТекстМодуляСтрокой);
			Результат.Вставить(ИмяМодуляДляВозврата, ОбщийТекстМодуляСтрокой);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;

	ОбщийТекстМодуля = Новый ТекстовыйДокумент;
	ДобавитьЗаголовокМодуля(ОбщийТекстМодуля);

	ТекстыПоГруппам = Новый Структура;
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПОД", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПОД", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПКО", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПКО", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам", Новый Структура);

	ТекстыПоГруппам.Вставить("ОбработчикиКонвертации", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("ОбработчикиКонвертацииПоГруппам", Новый Структура);


	ТекстПроцедуры_Конвертация = ЗаполнитьТекстПроцедурыКонвертации(ПараметрыМодуля, МакетТекстовМодулей);
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку("#Область ПроцедурыКонвертации");
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ТекстПроцедуры_Конвертация);
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку("#КонецОбласти");
	ВерсияФорматаМенеджераТекст = ПолучитьВерсиюФорматаМенеджера(ПараметрыМодуля, МакетТекстовМодулей);

	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ВерсияФорматаМенеджераТекст);

	ЗаполнитьТекстПроцедурыПОД(ТекстыПоГруппам, ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПКО(ТекстыПоГруппам, ПараметрыМодуля);

	ДобавитьПроцедурыПОДиПКОВМодуль(ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПКПД(ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыАлгоритмы(ТекстыПоГруппам, ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПараметры(ПараметрыМодуля, ПараметрыМодуля.ПрограммныйИнтерфейс);

	ЗаполнитьТекстПроцедурыВызоваОбработчиков(ПараметрыМодуля);

	ДобавитьПроцедурыВТекстМодуля(ОбщийТекстМодуля, ТекстыПоГруппам, ПараметрыМодуля);

	Стр = ОбщийТекстМодуля.ПолучитьТекст();
	// Удаление идентичных тегов закрытие + открытие
	ВыполнитьСхлопываниеТеговВМодуле(ПараметрыМодуля, Стр);

	#Вставка
	Стр = "//@skip-check undefined-variable
		|
		|" + Стр;
	Стр = СтрЗаменить(Стр, "ОбменДаннымиXDTOСервер", "кфкОбменДаннымиXDTOСервер");
	// фикс
	Стр = СтрЗаменить(Стр, "ИспользованиеПКО - Массив из Строка", "ИспользованиеПКО - Структура");
	#КонецВставки
	ОбщийТекстМодуля.УстановитьТекст(Стр);

	Возврат Новый Структура("МенеджерОбменаЧерезУниверсальныйФормат", ОбщийТекстМодуля);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеТекстаМодулей

&ИзменениеИКонтроль("ПолучитьВерсиюФорматаМенеджера")
Функция кфкПолучитьВерсиюФорматаМенеджера(ОбщиеПеременные, МакетТекстовМодулей)
	ВерсияФорматаМенеджераТекст = МакетТекстовМодулей.ПолучитьОбласть("ВерсияФорматаМенеджераОбмена").ПолучитьТекст();
	ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст,
		"#Область ВерсияФорматаМенеджераОбмена" + Символы.ПС, "");
	#Удаление
	ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст, "&ВерсияФорматаМенеджераОбмена",
									"""" + СокрЛП(ОбщиеПеременные.ВерсияФорматаМенеджера) + """");
	#КонецУдаления
	#Вставка
	ВерсияФорматаМенеджера = СокрЛП(ОбщиеПеременные.ВерсияФорматаМенеджера);
	Если ВерсияФорматаМенеджера = "2" Тогда
		ВерсияФорматаМенеджера = ВерсияФорматаМенеджера + ".КФК";
	КонецЕсли;
	ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст, "&ВерсияФорматаМенеджераОбмена",
									"""" + ВерсияФорматаМенеджера + """");
	#КонецВставки
	Возврат ВерсияФорматаМенеджераТекст;
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьТекстПроцедурыКонвертации")
Функция кфкЗаполнитьТекстПроцедурыКонвертации(ПараметрыМодуля, МакетТекстовМодулей)

	ТекстПроцедуры = Новый ТекстовыйДокумент;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Конвертации.АлгоритмПередКонвертацией КАК АлгоритмПередКонвертацией,
	|	Конвертации.АлгоритмПослеКонвертации КАК АлгоритмПослеКонвертации,
	|	Конвертации.АлгоритмПередОбработкойУдаления КАК АлгоритмПередОбработкойУдаления,
	|	Конвертации.АлгоритмПередОтложеннымЗаполнением КАК АлгоритмПередОтложеннымЗаполнением
	|ИЗ
	|	Справочник.Конвертации КАК Конвертации
	|ГДЕ
	|	Конвертации.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Конвертация);

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ПередКонвертациейЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередКонвертацией_Заголовок").ПолучитьТекст();
	ПередКонвертациейЗаголовок = СтрЗаменить(ПередКонвертациейЗаголовок,"#Область Конвертация_ПередКонвертацией_Заголовок", "---");
	#Вставка
	ПередКонвертациейЗаголовок = СтрЗаменить(ПередКонвертациейЗаголовок, "(КомпонентыОбмена)", "(КомпонентыОбмена, ДанныеИБ)");
	ПередКонвертациейЗаголовок = СтрЗаменить(ПередКонвертациейЗаголовок, "ИнициализироватьКомпонентыОбмена", "ИнициализироватьКомпонентыОбмена
	|//  ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ");
	#КонецВставки
	УдалитьПоследнийПереводСтроки(ПередКонвертациейЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередКонвертациейЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередКонвертацией) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередКонвертацией));
	КонецЕсли;
	Если ПараметрыМодуля.ВерсияФорматаМенеджера >= 3 Тогда
		// Инициализация условий применения правил.
		ТекстЗаполнениеУсловий = ЗаполнитьИспользуемыеУсловияПримененияПравил(ПараметрыМодуля);
		Если НЕ ПустаяСтрока(ТекстЗаполнениеУсловий) Тогда
			ТекстИнициализацияУсловий = МакетТекстовМодулей.ПолучитьОбласть("Служебные_ИнициализацияУсловийПримененияПравил").ПолучитьТекст();
			ТекстИнициализацияУсловий = СтрЗаменить(ТекстИнициализацияУсловий,"#Область Служебные_ИнициализацияУсловийПримененияПравил", "---");
			ТекстИнициализацияУсловий = "#Область ИнициализацияУсловийПримененияПравил" + Символы.ПС + ТекстИнициализацияУсловий + "#КонецОбласти";
			ТекстИнициализацияУсловий = СтрЗаменить(ТекстИнициализацияУсловий, "&ЗаполнениеУсловийПрименения", ТекстЗаполнениеУсловий);
			ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(ТекстИнициализацияУсловий));
		КонецЕсли;
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстПроцедуры.ДобавитьСтроку("");

	ПослеКонвертацииЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПослеКонвертации_Заголовок").ПолучитьТекст();
	ПослеКонвертацииЗаголовок = СтрЗаменить(ПослеКонвертацииЗаголовок,"#Область Конвертация_ПослеКонвертации_Заголовок", "---");
	#Вставка
	ПослеКонвертацииЗаголовок = СтрЗаменить(ПослеКонвертацииЗаголовок, "(КомпонентыОбмена)", "(КомпонентыОбмена, ДанныеИБ, Сообщение)");
	ПослеКонвертацииЗаголовок = СтрЗаменить(ПослеКонвертацииЗаголовок, "ИнициализироватьКомпонентыОбмена", "ИнициализироватьКомпонентыОбмена
	|//   ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ
	|//   Сообщение - Структура - сформированное сообщение");
	#КонецВставки
	УдалитьПоследнийПереводСтроки(ПослеКонвертацииЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПослеКонвертацииЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПослеКонвертации) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПослеКонвертации));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстПроцедуры.ДобавитьСтроку("");

	ПередОтложеннымЗаполнениемЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередОтложеннымЗаполнением_Заголовок").ПолучитьТекст();
	ПередОтложеннымЗаполнениемЗаголовок = СтрЗаменить(ПередОтложеннымЗаполнениемЗаголовок,"#Область Конвертация_ПередОтложеннымЗаполнением_Заголовок", "---");
	УдалитьПоследнийПереводСтроки(ПередОтложеннымЗаполнениемЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередОтложеннымЗаполнениемЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередОтложеннымЗаполнением) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередОтложеннымЗаполнением));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");

	#Удаление
	ПередУдалениемЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередОбработкойУдаления_Заголовок").ПолучитьТекст();
	ПередУдалениемЗаголовок = СтрЗаменить(ПередУдалениемЗаголовок,"#Область Конвертация_ПередОбработкойУдаления_Заголовок", "");
	УдалитьПоследнийПереводСтроки(ПередУдалениемЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередУдалениемЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередОбработкойУдаления) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередОбработкойУдаления));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	#КонецУдаления

	Возврат ТекстПроцедуры.ПолучитьТекст();

КонецФункции

&ИзменениеИКонтроль("ДобавитьПроцедурыВТекстМодуля")
Процедура кфкДобавитьПроцедурыВТекстМодуля(ОбщийТекстМодуля, ТекстыПоГруппам, ПараметрыМодуля, ЭтоМодульМенеджера)
	Если НЕ ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныйПрограммныйИнтерфейс");
		ОбщийТекстМодуля.ДобавитьСтроку(ПараметрыМодуля.ПрограммныйИнтерфейс.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // СлужебныйПрограммныйИнтерфейс
	КонецЕсли;
	Если НЕ ЭтоМодульМенеджера Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныеПроцедурыИФункции");
	КонецЕсли;
	Если НЕ (ПараметрыМодуля.ИспользоватьРазделениеМодуля И ПараметрыМодуля.ТекущийМодуль.ЭтоМодульМенеджера) Тогда
		ДобавитьУИДМодуля(ОбщийТекстМодуля);
	КонецЕсли;
	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПОД");
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПОД Цикл
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции_ПОД.ПолучитьТекст());
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // ПОД

	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПКО");
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПКО Цикл
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
		ОбщийТекстМодуля.ДобавитьСтроку("// " + ГруппаПравил.Ключ); // СлужебныйПрограммныйИнтерфейс
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции_ПКО.ПолучитьТекст());
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // ПКО
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам Цикл
		// Алгоритмы принудительно добавляем в конец позднее.
		Если  ГруппаПравил.Ключ = "Алгоритмы" Тогда
			Продолжить;
		КонецЕсли;
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции.ПолучитьТекст());
	СлужебныеПроцедурыДополнение = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Служебные_ЗаполнениеПКС").ПолучитьТекст();
	СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение,"#Область Служебные_ЗаполнениеПКС", "");
	Если ПараметрыМодуля.ВерсияФорматаМенеджера >= 3 И ПараметрыМодуля.Свойство("МассивИспользуемыхУсловийПрименения") Тогда
		СлужебныеУсловиеДобавленияПКС = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Служебные_ПроверкаУсловийПримененияПКС").ПолучитьТекст();
		СлужебныеУсловиеДобавленияПКС = СтрЗаменить(СлужебныеУсловиеДобавленияПКС, "#Область Служебные_ПроверкаУсловийПримененияПКС", "---");
		СлужебныеУсловиеДобавленияПКСДляСвойства = "Если РодительПКС = Неопределено Тогда"
			+ Символы.ПС + Символы.Таб + Символы.Таб + "Возврат;" + Символы.ПС + Символы.Таб + "КонецЕсли;" + Символы.ПС + СлужебныеУсловиеДобавленияПКС;
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПроверкаУсловийПримененияДляСвойства", СлужебныеУсловиеДобавленияПКСДляСвойства);
		СлужебныеУсловиеДобавленияПКСДляТЧ = СтрЗаменить(СлужебныеУсловиеДобавленияПКС, "Возврат", "Возврат Неопределено");
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПроверкаУсловийПримененияДляГруппы", СлужебныеУсловиеДобавленияПКСДляТЧ);
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПараметрУсловиеПрименения", ", УсловиеПрименения = """"");
	Иначе
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПроверкаУсловийПрименения", "---");
		СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение, "&ПараметрУсловиеПрименения", "");
	КонецЕсли;
	ОбщийТекстМодуля.ДобавитьСтроку(СлужебныеПроцедурыДополнение);
	Если ПараметрыМодуля.ГруппироватьПоОбъектамВыгрузки = Ложь Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область ОбработчикиКонвертации");
		Для Каждого ГруппаПравил Из ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам Цикл
			ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
			ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
			ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
		КонецЦикла;
		ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.ОбработчикиКонвертации.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // ОбработчикиКонвертации
	КонецЕсли;
	// Алгоритмы принудительно добавляем в конец.
	Если (НЕ ПараметрыМодуля.ИспользоватьРазделениеМодуля Или ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский)
		И ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам.Свойство("Алгоритмы") Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область Алгоритмы");
		ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам.Алгоритмы.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); // Алгоритмы
	КонецЕсли;
	#Вставка
	ОбщийТекстМодуля.ДобавитьСтроку(ПолучитьМакет("кфкСлужебныеПроцедурыИФункции").ПолучитьТекст()); // КФК-СлужебныеПроцедурыИФункции
	#КонецВставки
	Если НЕ ЭтоМодульМенеджера Тогда
		// Конец области Служебные процедуры и функции.
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); //СлужебныеПроцедурыИФункции
	КонецЕсли;
	УдалитьЛишниеСтрокиИзМодуля(ОбщийТекстМодуля);
КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьТипМетаданные")
Функция кфкПолучитьТипМетаданные(ТипОбъектаВыборки, ОбъектВыборки, БезМетаданных)
	Если СокрЛП(ОбъектВыборки) = "" Тогда
		Возврат "Неопределено";
	КонецЕсли;

	Если БезМетаданных Тогда
		ТипМетаданные = "";
	Иначе
		ТипМетаданные = "Метаданные.";
	КонецЕсли;

	ИмяОбъекта = СокрЛП(ОбъектВыборки);
	ИмяОбъекта = Прав(ИмяОбъекта, СтрДлина(ИмяОбъекта) - Найти(ИмяОбъекта,"."));
	Если ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Справочник
		Или Найти(НРег(ОбъектВыборки), НРег("СправочникСсылка.")) > 0 Тогда
		ТипОбъекта = "Справочники";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Документ
		Или Найти(НРег(ОбъектВыборки), НРег("ДокументСсылка.")) > 0 Тогда
		ТипОбъекта = "Документы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.БизнесПроцесс
		Или Найти(НРег(ОбъектВыборки), НРег("БизнесПроцессСсылка.")) > 0 Тогда
		ТипОбъекта = "БизнесПроцессы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Задача
		Или Найти(НРег(ОбъектВыборки), НРег("ЗадачаСсылка.")) > 0 Тогда
		ТипОбъекта = "Задачи";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.НаборКонстант
		Или Найти(НРег(ОбъектВыборки), НРег("КонстантыНабор")) > 0 Тогда
		ТипОбъекта = "Константы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		Или Найти(НРег(ОбъектВыборки), НРег("ПланВидовХарактеристикСсылка.")) > 0 Тогда
		ТипОбъекта = "ПланыВидовХарактеристик";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Перечисление
		Или Найти(НРег(ОбъектВыборки), НРег("ПеречислениеСсылка.")) > 0 Тогда
		ТипОбъекта = "Перечисления";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.РегистрСведений
		Или Найти(НРег(ОбъектВыборки), НРег("РегистрСведенийЗапись.")) > 0 Тогда
		ТипОбъекта = "РегистрыСведений";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.ПланВидовРасчета
		Или Найти(НРег(ОбъектВыборки), НРег("ПланВидовРасчетаСсылка.")) > 0 Тогда
		ТипОбъекта = "ПланыВидовРасчета";
	Иначе
		ТипОбъекта = "";
	КонецЕсли;
	#Вставка
	Если Не ПустаяСтрока(ТипОбъекта) Тогда
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.ПланОбмена
		Или СтрНайти(НРег(ОбъектВыборки), НРег("ПланОбменаСсылка.")) > 0 Тогда
		ТипОбъекта = "ПланыОбмена";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.ПланСчетов
		Или СтрНайти(НРег(ОбъектВыборки), НРег("ПланСчетовСсылка.")) > 0 Тогда
		ТипОбъекта = "ПланыСчетов";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.РегистрНакопления
		Или СтрНайти(НРег(ОбъектВыборки), НРег("РегистрНакопленияЗапись.")) > 0 Тогда
		ТипОбъекта = "РегистрыНакопления";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.РегистрБухгалтерии
		Или СтрНайти(НРег(ОбъектВыборки), НРег("РегистрБухгалтерииЗапись.")) > 0 Тогда
		ТипОбъекта = "РегистрыБухгалтерии";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.РегистрРасчета
		Или СтрНайти(НРег(ОбъектВыборки), НРег("РегистрРасчетаЗапись.")) > 0 Тогда
		ТипОбъекта = "РегистрыРасчета";
	КонецЕсли;
	#КонецВставки
	Возврат ТипМетаданные+ТипОбъекта+"."+ИмяОбъекта;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
